Repository: CZ-NIC/foris-storage-plugin
Catalog: foris_plugins/storage/locale/*/LC_MESSAGES/foris.po
Languages: de, lt, pl, ru, sk

source: storage
de: Speicher
lt: talpykla
pl: magazyn
ru: хранилище
sk: úložisko

source: Storage
de: Speicher
lt: Talpykla
pl: Magazyn
ru: Хранилище
sk: Úložisko

source: Here you can setup where your persistent data should be stored. If you want to use Nextcloud, LXC or other IO intensive applications, don't put them on internal flash, but always use external storage. Also make sure that your data will fit on the new drive before switching.
de: Hier können Sie einstellen, wo Ihre persistenten Daten gespeichert werden sollen. Wenn Sie Nextcloud, LXC oder andere IO-intensive Anwendungen verwenden möchten, stellen Sie diese nicht auf internen Flash, sondern verwenden Sie immer externen Speicher. Stellen Sie auch sicher, dass Ihre Daten auf das neue Laufwerk passen, bevor Sie wechseln.
lt: Čia galite nustatyti kur turėtų būti saugomi pastovūs duomenys. Jei norite naudoti Nexcloud, LXC ar kitas daug IO operacijų atliekančias programas, nedėkite jų duomenų vidinėje flash atmintyje ir visada naudokite išorinę talpyklą. Taip pat įsitikinkite kad duomenys tikrai tilps į naują diską prieš persijungiant į jį.
pl: Tutaj możesz ustawić miejsce przechowywania danych. Jeśli chcesz korzystać z aplikacji typu NextCloud, LXC lub innych intensywnie wykorzystujących IO, nie umieszczaj ich na wewnętrznej pamięci flash, ale zawsze korzystaj z pamięci zewnętrznej. Upewnij się również, że twoje dane zmieszczą się na nowym dysku przed przełączeniem.
ru: Здесь можно настроить, где должны храниться ваши постоянные данные. Если вы используете приложения Nextcloud, LXC или другие приложения интенсивного ввода-вывода, не помещайте их во внутреннюю флэш-память, используйте внешнее хранилище. Также убедитесь, что ваши данные поместятся на новый диск перед переходом.
sk: Tu je možné nastaviť, kde sa majú ukladať trvalé dáta. Pokiaľ chcete používať Nextcloud, LXC alebo iné aplikácie, ktoré veľa čítajú a zapisujú, rozhodne ich neumiestňujte na vstavanú flash pamäť, ale vždy použite externé úložisko. Tiež sa pred prepnutím uistite, že sa dáta na novú jednotku vojdú.

source: Once you choose a drive, it will be formatted to Btrfs filesystem and on next reboot your <em>/srv</em> (directory where all IO intesive applications should reisde) will get moved to this new drive.
de: Sobald Sie ein Laufwerk ausgewählt haben, wird darauf das Btrfs-Dateisystem formatiert und beim nächsten Neustart wird Ihr <em>/srv</em> (Verzeichnis, in dem alle IO-intensiven Anwendungen stattfinden) auf dieses neue Laufwerk verschoben.
lt: Kai pasirinksite diską jis bus formatuojamas į Btrfs failų sistemą ir per kitą persikrovimą <em>/srv</em> (katalogas kur IO sukelenčios programos turėtų dėti duomenis) bus perkeltas į naują diską.
pl: Po wybraniu dysku zostanie on sformatowany do systemu plików Btrfs, a po ponownym uruchomieniu systemu katalog <em>/srv</em> (katalog, w którym powinny być umieszczone wszystkie aplikacje intensywnie korzystające z zasobów IO) zostanie przeniesiony na nowy dysk.
ru: Как только вы выберете диск, он будет отформатирован в файловой системе Btrfs и при следующей перезагрузке ваш <em>/srv</em>(каталог, используемый всеми приложениями интенсивного ввода-вывода) будет перенесен на этот новый диск.
sk: Akonáhle zvolíte disk, bude sformátovaný na súborový systém btrfs a po reštarte sa na tento nový disk presunie <em>/srv</em> (priečinok, v ktorom by sa mali nachádzať všetky aplikácie náročné na vstup/výstup).

source: Device currently in use is %(old_device_name)s (%(uuid_text)s).
de: Das derzeit verwendete Gerät ist %(old_device_name)s (%(uuid_text)s).
lt: Dabar naudojamas diskas yra %(old_device_name)s (%(uuid_text)s).
pl: Urządzenie obecnie w użyciu to %(old_device_name)s (%(uuid_text)s).
ru: Используемое устройство %(old_device_name)s (%(uuid_text)s).
sk: Aktuálne používané zariadenie je %(old_device_name)s (%(uuid_text)s).

source: Processing changes at the moment, please wait...
de: Änderungen werden gerade verarbeitet, bitte warten...
lt: Apdorojami pakeitimai, prašome palaukti...
pl: Przetwarzanie zmian, proszę czekać...
ru: Обработка изменений на данный момент, пожалуйста, подождите ...
sk: Zmeny budú o chvíľu spracované, čakajte…

source: Device
de: Gerät
lt: Įrenginys
pl: Urządzenie
ru: Устройство
sk: Zariadenie

source: Description
de: Beschreibung
lt: Aprašymas
pl: Opis
ru: Описание
sk: Popis

source: Filesystem
de: Dateisystem
lt: Failų sistema
pl: System plików
ru: Файловая система
sk: Súborový systém

source: Changes to this setting will take effect on next reboot!
de: Änderungen an dieser Einstellung werden beim nächsten Neustart wirksam!
lt: Šio nustatymo pakeitimai bus pradėti naudoti tik po įrenginio perkrovimo!
pl: Wybrane zmiany będą obowiązywać przy następnym uruchomieniu!
ru: Изменения этого параметра вступят в силу при следующей перезагрузке!
sk: Zmeny v tomto nastavení sa prejavia až po reštarte!

source: Format &amp; Set
de: Formatieren &amp; Einstellen
lt: Formatuoti ir Nustatyti
pl: Formatuj &amp; Ustaw
ru: Формат &amp; установить
sk: Formátovať a nastaviť

source: No drives connected, please connect a drive and refresh the page.
de: Keine Laufwerke angeschlossen, bitte ein Laufwerk anschließen und die Seite aktualisieren.
lt: Nėra prijungtų diskų, prijunkite diską ir perkraukite puslapį.
pl: Brak podłączonych napędów, podłącz dysk i odśwież stronę.
ru: Нет подключенных дисков, подключите диск и обновите страницу.
sk: Nie sú pripojené žiadne disky, pripojte nejaký a nechajte stránku načítať znovu.

source: Are you sure you want to change where your srv is stored? Newly selected drive will be formated and you will loose all the data on it. Once formating is done, you'll get notification and you will be asked to reboot. On the reboot data will be moved from old drive to the new one. This can take some time so your next reboot will take longer. Are you sure you want to continue?
de: Sind Sie sicher, dass Sie ändern möchten, wo Ihr srv gespeichert ist? Das neu ausgewählte Laufwerk wird formatiert und Sie verlieren alle Daten auf ihm. Sobald die Formatierung abgeschlossen ist, erhalten Sie eine Benachrichtigung und werden zum Neustart aufgefordert. Beim Neustart werden die Daten vom alten Laufwerk auf das neue verschoben. Dies kann einige Zeit in Anspruch nehmen, so dass der nächste Neustart länger dauert. Sind Sie sicher, dass Sie weitermachen wollen?
lt: Ar tikrai norite pakeisti kur bus talpinamas /srv katalogas? Naujai parinktas diskas bus suformatuotas ir prarasite visus jame dabar esančius duomenis. Kai formatavimas bus baigtas gausite pranešimą su prašymu perkrauti įrenginį. Po perkrovimo duomenys bus perkelti į naują diską. Tai gali užtrukto todėl kitas perkrovimas užtruks ilgiau. Ar tikrai norite tęsti?
pl: Czy na pewno chcesz zmienić miejsce przechowywania katalogu /srv? Nowo wybrany dysk zostanie sformatowany, i stracisz wszystkie dane na nim zawarte. Po zakończeniu formatowania otrzymasz powiadomienie i zostaniesz poproszony o ponowne uruchomienie. Po ponownym uruchomieniu dane zostaną przeniesione ze starego dysku do nowego. Może to trochę potrwać, więc ponowne uruchomienie będzie trwało dłużej. Jesteś pewien, że chcesz kontynuować?
ru: Вы действительно хотите изменить диск, где хранится ваш srv? Новый диск будет отформатирован, и все данные на нем будут потеряны. После завершения формирования вы получите уведомление, и вас попросят перезагрузить. При перезагрузке данные будут перенесены со старого диска на новый. Это может занять некоторое время, поэтому следующая перезагрузка займет больше времени. Вы уверены, что хотите продолжить?
sk: Skutočne chcete zmeniť, kde je uložené /srv? Novo vybraný disk bude sformátovaný a všetky dáta, ktoré na ňom predtým boli, budú stratené. Po dokončení formátovania dostanete oznámenie a budete požiadaní o reštart. Pri reštarte budú dáta presunuté z pôvodnej jednotky na novú. To môže nejakú chvíľu trvať, takže najbližší reštart bude trvať dlhšie. Skutočne chcete pokračovať?
